{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 81,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "\n",
    "host = 'bolt://localhost:7687'\n",
    "user = 'neo4j'\n",
    "password = 'LimeStardom6J'\n",
    "driver = GraphDatabase.driver(host, auth=(user, password))\n",
    "\n",
    "def run_query(query, params={}):\n",
    "    with driver.session() as session:\n",
    "        result = session.run(query, params)\n",
    "        return result.to_df()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 88,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Movie title: The Matrix year: 1999 plot: Welcome to the Real World\n",
      "ACTED_IN: Emil Eifrem, Hugo Weaving, Laurence Fishburne, Carrie-Anne Moss, Keanu Reeves\n",
      "DIRECTED: Lana Wachowski, Lilly Wachowski\n",
      "\n"
     ]
    }
   ],
   "source": [
    "print(run_query(\"\"\"\n",
    "MATCH (m:Movie)\n",
    "MATCH (m)-[r:ACTED_IN|DIRECTED]-(t)\n",
    "WITH m, type(r) as type, collect(t.name) as names\n",
    "WITH m, type+\": \"+reduce(s=\"\", n IN names | s + n + \", \") as types\n",
    "WITH m, collect(types) as contexts\n",
    "WITH m, \"Movie title: \"+ m.title + \" year: \"+coalesce(m.released,\"\") +\" plot: \"+ coalesce(m.tagline,\"\")+\"\\n\" +\n",
    "       reduce(s=\"\", c in contexts | s + substring(c, 0, size(c)-2) +\"\\n\") as context\n",
    "RETURN context LIMIT 2\n",
    "\"\"\")['context'][0])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 71,
   "metadata": {},
   "outputs": [],
   "source": [
    "openai_api_key = \"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\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 89,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{}"
      ]
     },
     "execution_count": 89,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "run_query(\"\"\"\n",
    "CALL apoc.periodic.iterate(\n",
    "  'MATCH (m:Movie) RETURN id(m) AS id',\n",
    "  'MATCH (m:Movie)\n",
    "   WHERE id(m) = id\n",
    "   MATCH (m)-[r:ACTED_IN|DIRECTED]-(t)\n",
    "   WITH m, type(r) as type, collect(t.name) as names\n",
    "   WITH m, type+\": \"+reduce(s=\"\", n IN names | s + n + \", \") as types\n",
    "   WITH m, collect(types) as contexts\n",
    "   WITH m, \"Movie title: \"+ m.title + \" year: \"+coalesce(m.released,\"\") +\" plot: \"+ coalesce(m.tagline,\"\")+\"\\n\" +\n",
    "        reduce(s=\"\", c in contexts | s + substring(c, 0, size(c)-2) +\"\\n\") as context\n",
    "   CALL apoc.ml.openai.embedding([context], $apiKey) YIELD embedding\n",
    "   SET m.embedding = embedding',\n",
    "  {batchSize:1, retries:3, params: {apiKey: $apiKey}})\n",
    "\"\"\", {'apiKey': openai_api_key})['errorMessages'][0]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 72,
   "metadata": {},
   "outputs": [],
   "source": [
    "system_prompt = \"\"\"\n",
    "You are an assistant that helps to generate text to form nice and human understandable answers based.\n",
    "The latest prompt contains the information, and you need to generate a human readable response based on the given information.\n",
    "Make the answer sound as a response to the question. Do not mention that you based the result on the given information.\n",
    "Do not add any additional information that is not explicitly provided in the latest prompt.\n",
    "I repeat, do not add any information that is not explicitly given.\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 73,
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "def generate_user_prompt(question, context):\n",
    "    return f\"\"\"\n",
    "   The question is {question}\n",
    "   Answer the question by using the provided information:\n",
    "   {context}\n",
    "   \"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 74,
   "metadata": {},
   "outputs": [],
   "source": [
    "def retrieve_context(question, k=3):\n",
    "    data = run_query(\n",
    "        \"\"\"\n",
    "    // retrieve the embedding of the question\n",
    "    CALL apoc.ml.openai.embedding([$question], $apiKey) YIELD embedding\n",
    "    // match relevant movies\n",
    "    MATCH (m:Movie)\n",
    "    WITH m, gds.similarity.cosine(embedding, m.embedding) AS score\n",
    "    ORDER BY score DESC\n",
    "    // limit the number of relevant documents\n",
    "    LIMIT toInteger($k)\n",
    "    // retrieve graph context\n",
    "    MATCH (m)--()--(m1:Movie)\n",
    "    WITH m,m1, count(*) AS count\n",
    "    ORDER BY count DESC\n",
    "    WITH m, apoc.text.join(collect(m1.title)[..3], \", \") AS similarMovies\n",
    "    MATCH (m)-[r:ACTED_IN|DIRECTED]-(t)\n",
    "    WITH m, similarMovies, type(r) as type, collect(t.name) as names\n",
    "    WITH m, similarMovies, type+\": \"+reduce(s=\"\", n IN names | s + n + \", \") as types\n",
    "    WITH m, similarMovies, collect(types) as contexts\n",
    "    WITH m, \"Movie title: \"+ m.title + \" year: \"+coalesce(m.released,\"\") +\" plot: \"+ coalesce(m.tagline,\"\")+\"\\n\" +\n",
    "          reduce(s=\"\", c in contexts | s + substring(c, 0, size(c)-2) +\"\\n\") + \"similar movies:\" + similarMovies + \"\\n\" as context\n",
    "    RETURN context\n",
    "  \"\"\",\n",
    "        {\"question\": question, \"k\": k, \"apiKey\": openai_api_key},\n",
    "    )\n",
    "    return data[\"context\"].to_list()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 79,
   "metadata": {},
   "outputs": [],
   "source": [
    "def generate_answer(question):\n",
    "    # Retrieve context\n",
    "    context = retrieve_context(question)\n",
    "    # Print context\n",
    "    print(f'Start printing context:')\n",
    "    for c in context:\n",
    "        print(c)\n",
    "    print(f'End printing context.')\n",
    "    # Generate answer\n",
    "    response = run_query(\n",
    "        \"\"\"\n",
    "  CALL apoc.ml.openai.chat([{role:'system', content: $system}, {role: 'user', content: $user}], $apiKey) YIELD value\n",
    "  RETURN value.choices[0].message.content AS answer\n",
    "  \"\"\",\n",
    "        {\n",
    "            \"system\": system_prompt,\n",
    "            \"user\": generate_user_prompt(question, context),\n",
    "            \"apiKey\": openai_api_key,\n",
    "        },\n",
    "    )\n",
    "    return response[\"answer\"][0]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 80,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Movie title: The Matrix year: 1999 plot: Welcome to the Real World\n",
      "ACTED_IN: Emil Eifrem, Hugo Weaving, Laurence Fishburne, Carrie-Anne Moss, Keanu Reeves\n",
      "DIRECTED: Lana Wachowski, Lilly Wachowski\n",
      "similar movies:The Matrix Revolutions, The Matrix Reloaded, V for Vendetta\n",
      "\n",
      "Movie title: The Matrix Reloaded year: 2003 plot: Free your mind\n",
      "DIRECTED: Lana Wachowski, Lilly Wachowski\n",
      "ACTED_IN: Hugo Weaving, Laurence Fishburne, Carrie-Anne Moss, Keanu Reeves\n",
      "similar movies:The Matrix Revolutions, The Matrix, V for Vendetta\n",
      "\n",
      "Movie title: The Matrix Revolutions year: 2003 plot: Everything that has a beginning has an end\n",
      "DIRECTED: Lana Wachowski, Lilly Wachowski\n",
      "ACTED_IN: Hugo Weaving, Laurence Fishburne, Carrie-Anne Moss, Keanu Reeves\n",
      "similar movies:The Matrix Reloaded, The Matrix, V for Vendetta\n",
      "\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'The actors who played in the movie \"The Matrix\" are Emil Eifrem, Hugo Weaving, Laurence Fishburne, Carrie-Anne Moss, and Keanu Reeves.'"
      ]
     },
     "execution_count": 80,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "generate_answer(\"Who played in the Matrix?\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "torch",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.4"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
